#+title: Vary Delay

* Kendryte K230
#+PLOT: title:"K230 | Varied Delay, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Max Delay'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:15]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|----------+--------------+--------------+---------------|
| N+N Size |         risp |        vrisp |    vrisp-full |
|----------+--------------+--------------+---------------|
|        / |            < |            < |             < |
|        1 | 14213.045017 | 52661.235538 | 112684.944165 |
|        2 | 15792.125099 | 53029.861115 | 113023.723680 |
|        3 | 16371.167101 | 52141.993076 | 113518.974697 |
|        4 | 15599.991264 | 51825.286594 | 112943.302462 |
|        5 | 16061.160901 | 51808.371197 | 113204.129687 |
|        6 | 15006.137510 | 51162.409954 | 111426.820436 |
|        7 | 14635.695583 | 51170.263936 | 111013.665782 |
|        8 | 14643.518193 | 51204.587931 | 107143.239797 |
|        9 | 14635.974053 | 50889.808298 | 111548.629625 |
|       10 | 13214.805339 | 51015.202530 | 112213.295031 |
|       11 | 12506.456458 | 51047.755175 | 111400.753069 |
|       12 | 13278.731191 | 50948.923704 | 111161.751465 |
|       13 | 13930.874998 | 50400.685449 | 112010.932267 |
|       14 | 14512.945547 | 50518.317942 | 111813.048583 |
|       15 | 13820.286522 | 50671.652757 | 111170.401992 |
|----------+--------------+--------------+---------------|

* MilkV Jupiter
#+PLOT: title:"Jupiter | Varied Delay, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Max Delay'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:15]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|  _ |         risp |        vrisp |   vrisp-full |
|  1 | 16515.167530 | 56330.728976 | 88228.547229 |
|  2 | 16332.930454 | 56281.588041 | 87504.375219 |
|  3 | 16250.755660 | 55151.418219 | 87426.343306 |
|  4 | 16220.915898 | 54545.851243 | 87025.385305 |
|  5 | 16087.076126 | 54036.236700 | 87604.797239 |
|  6 | 16135.746811 | 54036.236700 | 87036.746915 |
|  7 | 16050.256563 | 53960.134253 | 87470.697316 |
|  8 | 15970.818121 | 53782.814240 | 87624.755746 |
|  9 | 15940.929292 | 53394.273998 | 87526.586201 |
| 10 | 14821.555878 | 53723.292808 | 87493.656710 |
| 11 | 15840.680769 | 53315.987865 | 86826.659257 |
| 12 | 15865.309865 | 53043.362949 | 86018.545598 |
| 13 | 15813.376852 | 53183.285557 | 87730.072114 |
| 14 | 15671.573959 | 52950.956824 | 87446.985265 |
| 15 | 15598.579905 | 52926.574963 | 86497.707811 |

* Desktop Intel i5-12400F
#+PLOT: title:"Desktop | Varied Delay, Network 64+64, 32 Synapse Fan-out, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Max Random Delay'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:15]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")
- 64 Input Neurons, 64 Output Neurons, 32 Fan-out, Random Delay 1-N
- 25% Activity, Averaged over 5000 time steps
- Fan-out describes how many output neurons each input is connected to
#+ATTR_HTML: :align center
#+CAPTION: Simulation time steps per second
|-----------+-----------+-----------+------------+------------------|
| Max Delay |      risp |     vrisp | superneuro | vrisp/superneuro |
|-----------+-----------+-----------+------------+------------------|
|         / |         < |         < |          < |                < |
|         1 | 258371.22 | 617055.41 |   33961.96 |        18.169016 |
|         2 | 233067.63 | 617779.69 |    4844.98 |        127.50923 |
|         3 | 235177.91 | 618314.47 |     967.43 |        639.13097 |
|         4 | 247622.82 | 616750.95 |     433.93 |        1421.3144 |
|         5 | 233007.89 | 615384.61 |     251.63 |        2445.5932 |
|         6 | 229694.96 | 615687.72 |     165.28 |        3725.1193 |
|         7 | 233945.49 | 609533.09 |     113.92 |        5350.5363 |
|         8 | 236787.27 | 607644.16 |      81.67 |        7440.2371 |
|         9 | 234901.69 | 615915.25 |      65.05 |        9468.3359 |
|        10 | 241411.77 | 609310.26 |      50.89 |        11973.084 |
|        11 | 230186.68 | 612895.31 |      39.57 |        15488.888 |
|        12 | 253826.43 | 326381.40 |      32.72 |        9974.9817 |
|        13 | 234175.58 | 614326.08 |      28.26 |        21738.361 |
|        14 | 231577.97 | 605913.71 |      23.14 |        26184.689 |
|        15 | 215996.71 | 604521.82 |      20.61 |        29331.481 |
|-----------+-----------+-----------+------------+------------------|
#+TBLFM: $5=($3/$4)
